In [21]:
import numpy as np
import pandas as pd

In [22]:
np.random.seed(45)
n=100
data =({
    "ID":np.arange(1,n+1),
    "Name":np.random.choice(["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah"],n),
    "Age":np.random.randint(18,60,n),
    "Score":np.random.uniform(0,100,n),
    })

In [23]:
df=pd.DataFrame(data)
df

     ID    Name  Age      Score
0     1   David   37  42.099381
1     2   Grace   45  18.181084
2     3   David   32  22.681981
3     4     Eva   36  84.186979
4     5   Alice   41  31.527662
..  ...     ...  ...        ...
95   96   David   52  86.293355
96   97     Bob   22  29.654633
97   98   Frank   22  81.087131
98   99  Hannah   26  71.105661
99  100   David   20  37.037323

[100 rows x 4 columns]

In [35]:
np.random.seed(45)
n=100
id=np.arange(1,n+1,5)
data =({
    "ID":id,
    "Name":np.random.choice(["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah"],len(id)),
    "Age":np.random.randint(18,60,len(id)),
    "Score":np.random.uniform(0,100,len(id)),
    })

In [36]:
df=pd.DataFrame(data)
df

    ID    Name  Age      Score
0    1   David   26   1.695396
1    6   Grace   30  96.739741
2   11   David   52  82.771891
3   16     Eva   42  73.254109
4   21   Alice   30  16.341112
5   26  Hannah   35  78.807222
6   31   Frank   56  40.328869
7   36   Frank   22  97.791343
8   41   David   48  22.956426
9   46     Eva   32  56.047923
10  51     Bob   54  95.608414
11  56   Alice   49  23.313138
12  61  Hannah   40  86.688773
13  66     Bob   54  38.516862
14  71   Grace   33  80.622244
15  76   Frank   35  56.875300
16  81     Bob   24  40.544134
17  86   Grace   29  13.602531
18  91   Alice   58   2.015188
19  96  Hannah   26  18.022120

In [32]:
df['new_column'] = 50
df

     ID    Name  Age      Score  new_column
0     1   David   37  42.099381          50
1     2   Grace   45  18.181084          50
2     3   David   32  22.681981          50
3     4     Eva   36  84.186979          50
4     5   Alice   41  31.527662          50
..  ...     ...  ...        ...         ...
95   96   David   52  86.293355          50
96   97     Bob   22  29.654633          50
97   98   Frank   22  81.087131          50
98   99  Hannah   26  71.105661          50
99  100   David   20  37.037323          50

[100 rows x 5 columns]

In [34]:
#df['new_column']= [2,4,5,60]
df

     ID    Name  Age      Score  new_column
0     1   David   37  42.099381          50
1     2   Grace   45  18.181084          50
2     3   David   32  22.681981          50
3     4     Eva   36  84.186979          50
4     5   Alice   41  31.527662          50
..  ...     ...  ...        ...         ...
95   96   David   52  86.293355          50
96   97     Bob   22  29.654633          50
97   98   Frank   22  81.087131          50
98   99  Hannah   26  71.105661          50
99  100   David   20  37.037323          50

[100 rows x 5 columns]